app/controllers/artistas_controller.rb

  def prueba
  	@prueba = Prueba.all
---
SELECT "pruebas".* FROM "pruebas"

  def ver
  	@prueba = Prueba.find(params[:id])
---
SELECT  "pruebas".* FROM "pruebas" WHERE "pruebas"."id" = ? LIMIT 1  [["id", 1]]