app/controllers/artistas_controller.rb

SELECT "artists".* FROM "artists"
---
  def prueba
  	@artist = Artist.all

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
---
  def ver
  	@artist = Artist.find(params[:id])