app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("content", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "hoh"], ["post_id", 1], ["created_at", "2016-11-03 14:04:13.287124"], ["updated_at", "2016-11-03 14:04:13.287124"]]
---
	def create
		@post = Post.find(params[:post_id])
		@comment = @post.comments.create(comments_params)