app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "hola"], ["content", "kjba"], ["user_id", 1], ["created_at", "2016-11-03 13:26:01.425817"], ["updated_at", "2016-11-03 13:26:01.425817"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save